Revit 2027 API
BuiltInFailures.SharedCoordinatesFailures.CannotAcquireCoordinatesFromLinkWithScaledLocation Property
 Can't acquire coordiantes from a link that has a scaled location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotAcquireCoordinatesFromLinkWithScaledLocation { get; }
Public Shared ReadOnly Property CannotAcquireCoordinatesFromLinkWithScaledLocation As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotAcquireCoordinatesFromLinkWithScaledLocation {
	FailureDefinitionId^ get ();
}
static member CannotAcquireCoordinatesFromLinkWithScaledLocation : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SharedCoordinatesFailures Class
Autodesk.Revit.DB Namespace